In [1]:
%load_ext sql

In [2]:
from time import time
import configparser
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg')) 

KEY = config.get('AWS','Key')
SECRET = config.get('AWS','secret')

DWH_DB= config.get("DWH","DWH_DB")
DWH_DB_USER= config.get("DWH","DWH_DB_USER")
DWH_DB_PASSWORD= config.get("DWH","DWH_DB_PASSWORD")
DWH_PORT = config.get("DWH","DWH_PORT")

# STEP 1: Get the params of the created redshift cluster 
- We need:
    - The redshift cluster <font color='red'>endpoint</font>
    - The <font color='red'>IAM role ARN</font> that give access to Redshift to read from S3

In [4]:
# FILL IN THE REDSHIFT ENDPOINT HERE
# e.g. DWH_ENDPOINT="redshift-cluster-1.[].us-west-2.redshift.amazonaws.com" 
DWH_ENDPOINT="redshift-cluster.{}.us-west-2.redshift.amazonaws.com"
    
#FILL IN THE IAM ROLE ARN you got in step 2.2 of the previous exercise
#e.g DWH_ROLE_ARN="arn:aws:iam::{}:role/dwhRole"
DWH_ROLE_ARN="arn:aws:iam::{}:role/dwhRole"

#  STEP 2: Connect to the Redshift Cluster

In [5]:
import os 
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://awsuser:Suh0902$@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev

'Connected: awsuser@dev'

#  STEP 3: Create Required Tables

In [6]:
%%sql 
DROP TABLE IF EXISTS staging_songs;
DROP TABLE IF EXISTS staging_events;
DROP TABLE IF EXISTS songplays;
DROP TABLE IF EXISTS users;
DROP TABLE IF EXISTS songs;
DROP TABLE IF EXISTS artists;
DROP TABLE IF EXISTS times;




CREATE TABLE "staging_songs" (
    "num_songs" INTEGER ,
    "artist_id" VARCHAR(100),
    "artist_latitude" VARCHAR(100),
    "artist_longitude" VARCHAR(100),
    "artist_location" VARCHAR(250),
    "artist_name" VARCHAR(100),
    "song_id" VARCHAR(100),
    "title" VARCHAR(200),
    "duration" numeric(10,5),
    "year" INTEGER
);

DROP TABLE IF EXISTS staging_events;
CREATE TABLE "staging_events" (
    "artist" VARCHAR(200),
    "auth" VARCHAR(30),
    "firstName" VARCHAR(100),
    "gender" VARCHAR(10),
    "itemInSession" SMALLINT,
    "lastName" VARCHAR(50),
    "length" numeric(10,5),
    "level" VARCHAR(10),
    "location" VARCHAR(250), 
    "method" VARCHAR(10),
    "page" VARCHAR(20),
    "registeration" DECIMAL,
    "sessionId" BIGINT,
    "song" VARCHAR(250),
    "status" VARCHAR(30),
    "ts" BIGINT,
    "userAgent" VARCHAR(300),
    "userId" INTEGER

);



CREATE TABLE songs 
(
    song_id VARCHAR PRIMARY KEY NOT NULL sortkey distkey,
    title VARCHAR,
    artist_id VARCHAR,
    year INTEGER,
    duration numeric(10,5)
);

CREATE TABLE artists 
(
    artist_id VARCHAR PRIMARY KEY NOT NULL sortkey,
    name VARCHAR,
    location VARCHAR, 
    lattitude VARCHAR,
    longitude VARCHAR
);

CREATE TABLE songplays 
(
    songplay_id INTEGER IDENTITY(0,1) PRIMARY KEY,
    start_time TIMESTAMP NOT NULL,
    user_id INTEGER NOT NULL,
    level VARCHAR,
    song_id VARCHAR distkey, 
    artist_id VARCHAR sortkey,
    session_id INTEGER,
    location VARCHAR,
    user_agent VARCHAR
);

CREATE TABLE users 
(
    user_id INTEGER PRIMARY KEY NOT NULL sortkey,
    first_name VARCHAR,
    last_name VARCHAR,
    gender VARCHAR,
    level VARCHAR
);

CREATE TABLE times 
(
    starttime TIMESTAMP PRIMARY KEY NOT NULL sortkey,
    hour INTEGER,
    day INTEGER,
    week INTEGER,
    month INTEGER,
    year INTEGER,
    weekday INTEGER
);

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# STEP 4: Copying tables

In [7]:
%%time
song_data = config.get('S3','SONG_DATA')
qry = """
    copy staging_songs from {}
    credentials 'aws_iam_role={}'
    format as json 'auto' compupdate off STATUPDATE ON TRUNCATECOLUMNS region 'us-west-2';
""".format(song_data, DWH_ROLE_ARN)

%sql $qry

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
Done.
CPU times: user 5.73 ms, sys: 310 µs, total: 6.04 ms
Wall time: 14min 45s

In [8]:
%%time
log_data = config.get('S3','LOG_DATA')
log_json_path = config.get('S3', 'LOG_JSONPATH')
qry = """
    copy staging_events from {}
    credentials 'aws_iam_role={}'
    format as json {} compupdate off TRUNCATECOLUMNS region 'us-west-2';
""".format(log_data, DWH_ROLE_ARN, log_json_path)

%sql $qry

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
Done.
CPU times: user 4.8 ms, sys: 36 µs, total: 4.83 ms
Wall time: 1.96 s

# STEP 5: Insert from staging tables into Final tables

In [29]:
%%time

query_1 = """
    INSERT INTO times
    SELECT 
        distinct starttime,
        EXTRACT(hour from starttime) as hour,
        EXTRACT(day from starttime) as day,
        EXTRACT(week from starttime) as week,
        EXTRACT(month from starttime) as month,
        EXTRACT(year from starttime) as year,
        EXTRACT(weekday from starttime) as weekday 
        FROM   
            (SELECT TIMESTAMP 'epoch' + e.ts/1000 * interval '1 second' AS starttime
            FROM staging_events e)
     """

%sql $query

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
2871 rows affected.
CPU times: user 8.07 ms, sys: 721 µs, total: 8.79 ms
Wall time: 327 ms

In [30]:
%%time

query_2 = """
    INSERT INTO users
    SELECT 
        DISTINCT userId,
        firstName,
        lastName,
        gender,
        level FROM staging_events where page != 'NextSong' 
        AND userID is not NULL"""

%sql $query

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
2871 rows affected.
CPU times: user 7.21 ms, sys: 551 µs, total: 7.76 ms
Wall time: 330 ms

In [31]:
%%time

query_3 = """
    INSERT INTO artists
    SELECT 
        DISTINCT artist_id,
        artist_name,
        artist_location,
        artist_latitude,
        artist_longitude FROM staging_songs where artist_id is not null """

%sql $query

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
2871 rows affected.
CPU times: user 7.33 ms, sys: 582 µs, total: 7.91 ms
Wall time: 334 ms

In [32]:
%%time

query_4 = """
    INSERT INTO songs
    SELECT 
        DISTINCT song_id,
        title,
        artist_id,
        year,
        duration FROM staging_songs where song_id is not null"""

%sql $query

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
2871 rows affected.
CPU times: user 8.47 ms, sys: 0 ns, total: 8.47 ms
Wall time: 332 ms

In [33]:
%%time

query_5 = """
    INSERT INTO songplays (start_time, user_id, level, song_id, artist_id, session_id, location, user_agent)
    SELECT 
        TIMESTAMP 'epoch' + e.ts/1000 * interval '1 second' AS starttime,
        userId,
        level,
        song_id,
        artist_id,
        sessionId,
        location,
        userAgent
        FROM staging_songs s JOIN staging_events e
        ON s.artist_name = e.artist 
        AND s.title = e.song
        AND e.length = s.duration
        WHERE e.page ='NextSong' """

%sql $qry

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
2871 rows affected.
CPU times: user 7.45 ms, sys: 513 µs, total: 7.96 ms
Wall time: 337 ms

# STEP 6: TEST

In [25]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(572, datetime.datetime(2018, 11, 4, 9, 41, 55), 44, 'paid', 'SOAFQGA12A8C1367FA', 'AR0IVTL1187B9AD520', 196, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (574, datetime.datetime(2018, 11, 4, 9, 41, 55), 44, 'paid', 'SOAFQGA12A8C1367FA', 'AR0IVTL1187B9AD520', 196, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (24, datetime.datetime(2018, 11, 29, 21, 0, 3), 80, 'paid', 'SOXQYSC12A6310E908', 'AR0L04E1187B9AE90C', 1065, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (26, datetime.datetime(2018, 11, 13, 22, 39, 39), 55, 'free', 'SOXQYSC12A6310E908', 'AR0L04E1187B9AE90C', 415, 'Minneapolis-St. Paul-Bloomington, MN-WI', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (28, datetime.datetime(2018, 11, 29, 21, 0, 3), 80, 'paid', 'SOXQYSC12A6310E908', 'AR0L04E1187B9AE90C', 1065, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

In [26]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(2, 'Jizelle', 'Benjamin', 'F', 'free'),
 (7, 'Adelyn', 'Jordan', 'F', 'free'),
 (12, 'Austin', 'Rosales', 'M', 'free'),
 (15, 'Lily', 'Koch', 'F', 'paid'),
 (16, 'Rylan', 'George', 'M', 'paid')]

In [27]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('SOAACFC12A8C140567', 'Supernatural Pt. II', 'ARNHTE41187B99289A', 0, Decimal('343.09179')),
 ('SOAACTC12AB0186A20', 'Christmas Is Coming Soon', 'ARXWFZ21187FB43A0B', 2008, Decimal('180.76688')),
 ('SOAADJH12AB018BD30', 'Black Light (Album Version)', 'AR3FKJ61187B990357', 1975, Decimal('385.90649')),
 ('SOAAEHR12A6D4FB060', 'Slaves & Bulldozers', 'AR5N8VN1187FB37A4E', 1991, Decimal('415.81668')),
 ('SOAAFUV12AB018831D', 'Where Do The Children Play? (LP Version)', 'AR5ZGC11187FB417A3', 0, Decimal('216.05832'))]

In [28]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('AR00Y9I1187B999412', 'Akercocke', '', None, None),
 ('AR00YYQ1187FB504DC', 'God Is My Co-Pilot', 'New York, NY', '40.714550000000003', '-74.00712'),
 ('AR01G6G1187B9892EF', 'Tonino Carotone', '', None, None),
 ('AR01S3D1187FB50A53', 'Charlie Parr', 'Minnesota', None, None),
 ('AR01SCU1187B9A693C', 'Street Dogs', 'Boston, MA', None, None)]

In [19]:
%sql SELECT * FROM times LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cg3azka8k03z.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 1, 46), 21, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 1, 21, 8, 16), 21, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 1, 21, 11, 13), 21, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 1, 21, 17, 33), 21, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 1, 21, 24, 53), 21, 1, 44, 11, 2018, 4)]